# ViewSlantedColumnSymbolOffset Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..ViewSlantedColumnSymbolOffset Property
ParameterTypeId Class See Also
---
"Column Symbolic Offset"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId ViewSlantedColumnSymbolOffset { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ViewSlantedColumnSymbolOffset As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ ViewSlantedColumnSymbolOffset {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace